TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/emulate_device/emulate_device_ex1_f29p58x/emulate_device_ex1_f29p58x.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F29H85x" --part "F29P589DU5QZEX" --package "256ZEX" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @v2CliArgs --device "F29P589DU-Q1" --package "256ZEX" --variant "TMS320F29P589DU5-Q" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
* @versions {"tool":"1.25.0+4237"}
 */

    
const divider15       = system.clockTree["PLL_REFDIV"];
divider15.divideValue = 1;

const multiplier1         = system.clockTree["PLL_IMULT"];
multiplier1.multiplyValue = 40;

const mux7       = system.clockTree["OSCCLKSRCSEL"];
mux7.inputSelect = "INTOSC2";

/**
 * Import the modules used in this configuration.
 */
const led     = scripting.addModule("/driverlib/board_components/led", {}, false);
const led1    = led.addInstance();
const led2    = led.addInstance();
const jtag    = scripting.addModule("/driverlib/jtag.js");

/**
 * Write custom configuration values to the imported modules.
 */
led1.$name                  = "myBoardLED0";
led1.gpio.writeInitialValue = true;
led1.gpio.initialValue      = 1;
led1.gpio.gpioPin.$assign   = "GPIO9";

led2.$name                  = "myBoardLED1";
led2.gpio.writeInitialValue = true;
led2.gpio.gpioPin.$assign   = "GPIO23";